Revit 2027 API
NonContinuousRailInfo.ProfileId Property
 The profile id of the non-continuous rail, or invalidElementId if none.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ProfileId { get; set; }
Public Property ProfileId As ElementId
	Get
	Set
public:
property ElementId^ ProfileId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ProfileId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The profileId is not an Id of a valid NonContinuousRail profile.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
NonContinuousRailInfo Class
Autodesk.Revit.DB.Architecture Namespace